/*-------------------------------------------------*/
/*            超子说物联网STM32系列开发板          */
/*-------------------------------------------------*/
/*                                                 */
/*          实现各种中断服务函数的源文件           */
/*                                                 */
/*-------------------------------------------------*/

#include "stm32g0xx_hal.h"   
#include "usart.h"            
#include "timer.h"         
#include "key_capture.h"      

/*-------------------------------------------------*/
/*函数名：串口1中断处理函数                        */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void USART1_IRQHandler(void)
{		
	HAL_UART_IRQHandler(&U1_CB.USART_Handler);		
}
/*-------------------------------------------------*/
/*函数名：串口2中断处理函数                        */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void USART2_IRQHandler(void)
{		
	HAL_UART_IRQHandler(&U2_CB.USART_Handler);		
}
/*-------------------------------------------------*/
/*函数名：串口3/4中断处理函数                      */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void USART3_4_IRQHandler(void)
{	
	HAL_UART_IRQHandler(&U3_CB.USART_Handler);	
	HAL_UART_IRQHandler(&U4_CB.USART_Handler);	
}
/*-------------------------------------------------*/
/*函数名：DMA通道1中断处理函数                     */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void DMA1_Channel1_IRQHandler(void)
{
	HAL_DMA_IRQHandler(&U1_CB.USART_RxDMA);
}
/*-------------------------------------------------*/
/*函数名：DMA通道2/3中断处理函数                   */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void DMA1_Channel2_3_IRQHandler(void)
{
	HAL_DMA_IRQHandler(&U2_CB.USART_TxDMA);
	HAL_DMA_IRQHandler(&U2_CB.USART_RxDMA);
}
/*-------------------------------------------------*/
/*函数名：DMA通道4-7中断处理函数                   */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void DMA1_Ch4_7_DMAMUX1_OVR_IRQHandler(void)
{
	HAL_DMA_IRQHandler(&U3_CB.USART_TxDMA);
	HAL_DMA_IRQHandler(&U3_CB.USART_RxDMA);
	HAL_DMA_IRQHandler(&U4_CB.USART_TxDMA);
	HAL_DMA_IRQHandler(&U4_CB.USART_RxDMA);
}
/*-------------------------------------------------*/
/*函数名：定时器3中断服务函数                      */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void TIM3_IRQHandler(void)
{
	HAL_TIM_IRQHandler(&tim3);    
}
/*-------------------------------------------------*/
/*函数名：定时器6中断服务函数                      */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void TIM6_IRQHandler(void)
{
	HAL_TIM_IRQHandler(&tim6);    
}
/*-------------------------------------------------*/
/*函数名：定时器14中断处理函数                     */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void TIM14_IRQHandler(void)
{
	HAL_TIM_IRQHandler(&tim14);
}
/*-------------------------------------------------*/
/*函数名：不可屏蔽中断处理函数                     */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void NMI_Handler(void)
{

}

/*-------------------------------------------------*/
/*函数名：硬件出错后进入的中断处理函数             */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void HardFault_Handler(void)
{

}
/*-------------------------------------------------*/
/*函数名：软中断，SWI 指令调用的处理函数           */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void SVC_Handler(void)
{
	
}
/*-------------------------------------------------*/
/*函数名：可挂起的系统服务处理函数                 */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void PendSV_Handler(void)
{
	
}
/*-------------------------------------------------*/
/*函数名：SysTic系统嘀嗒定时器处理函数             */
/*参  数：无                                       */
/*返回值：无                                       */
/*-------------------------------------------------*/
void SysTick_Handler(void)
{  
	HAL_IncTick();	
}
