/*-------------------------------------------------*/
/*           ����˵������STM32ϵ�п�����           */
/*-------------------------------------------------*/
/*                                                 */
/*             ʵ�ָ������ڹ��ܵ�ͷ�ļ�            */
/*                                                 */
/*-------------------------------------------------*/

#ifndef __USART_H
#define __USART_H
      
#include "stdint.h"          
#include "stm32g0xx_hal_dma.h"

#define U1_TXBUFF_SIZE     1024*1                  //���崮��1 ���ͻ�������С
#define U1_RXBUFF_SIZE     1024*1                  //���崮��1 ���ջ�������С
#define U1_RXMAX_SIZE      256                     //���崮��1 ��ֵ����ڵ������һ�����ݰ��ĳ��ȣ���֤������DMA����ж�

#define U2_TXBUFF_SIZE     1024*1                  //���崮��2 ���ͻ�������С
#define U2_RXBUFF_SIZE     1024*2                  //���崮��2 ���ջ�������С
#define U2_RXMAX_SIZE      1024                    //���崮��2 ��ֵ����ڵ������һ�����ݰ��ĳ��ȣ���֤������DMA����ж�

#define U3_TXBUFF_SIZE     1024*1                  //���崮��3 ���ͻ�������С
#define U3_RXBUFF_SIZE     1024*1                  //���崮��3 ���ջ�������С
#define U3_RXMAX_SIZE      256                     //���崮��3 ��ֵ����ڵ������һ�����ݰ��ĳ��ȣ���֤������DMA����ж�

#define U4_TXBUFF_SIZE     1024*1                  //���崮��4 ���ͻ�������С
#define U4_RXBUFF_SIZE     1024*2                  //���崮��4 ���ջ�������С
#define U4_RXMAX_SIZE      1024                    //���崮��4 ��ֵ����ڵ������һ�����ݰ��ĳ��ȣ���֤������DMA����ж�

#define TX_NUM  30                                 //���ͻ����� ʹ�õ� seָ��� ����
#define RX_NUM  30                                 //���ջ����� ʹ�õ� seָ��� ����

typedef struct{       
	uint8_t *s;                                    //��� �������� or �������� �ڻ������е� ��ʼλ��
	uint8_t *e;                                    //��� �������� or �������� �ڻ������е� ��βλ��
}se_struct;                                        //seָ��Խṹ��

typedef struct{        
	uint32_t   RxCounter;                          //�ۼ� ���ջ����� �Ѿ���ŵ�������
	uint32_t   TxCounter;                          //�ۼ� ���ͻ����� �Ѿ���ŵ�������
	uint8_t    TxCpltflag;                         //DMA����״̬ 0������  �������ǿ���
	
	se_struct  se_RxBuff[RX_NUM];                  //���ջ����� seָ��Խṹ�� ����
	se_struct *RxIN;                               //���ջ����� INָ��
	se_struct *RxOUT;                              //���ջ����� OUTָ��
	
	se_struct  se_TxBuff[TX_NUM];                  //���ͻ����� seָ��Խṹ�� ����
	se_struct *TxIN;                               //���ͻ����� INָ��
	se_struct *TxOUT;                              //���ͻ����� OUTָ��
	
	UART_HandleTypeDef USART_Handler;              //�����ܿؽṹ��
	DMA_HandleTypeDef  USART_RxDMA;                //���ڽ���DMA�ܿؽṹ��
	DMA_HandleTypeDef  USART_TxDMA;                //���ڷ���DMA�ܿؽṹ��
	
}Usart_CB;                                         //���ڿ��ƽṹ��

#define TX_STA_DMA   0x01                          //����״̬��������DMA����
#define TX_STA_ACK   0x02                          //����״̬�������ѷ��ͣ��ȵ��ڵ�Ӧ��
 
extern Usart_CB U1_CB;                             //�ⲿ��������������1���ƽṹ��
extern Usart_CB U2_CB;                             //�ⲿ��������������2���ƽṹ��
extern Usart_CB U3_CB;                             //�ⲿ��������������3���ƽṹ��
extern Usart_CB U4_CB;                             //�ⲿ��������������4���ƽṹ��
extern uint8_t  U1_TxBuff[U1_TXBUFF_SIZE];         //�ⲿ��������������1���ͻ����� 
extern uint8_t  U1_RxBuff[U1_RXBUFF_SIZE];         //�ⲿ��������������1���ջ����� 
extern uint8_t  U3_TxBuff[U3_TXBUFF_SIZE];         //�ⲿ��������������3���ͻ����� 
extern uint8_t  U3_RxBuff[U3_RXBUFF_SIZE];         //�ⲿ��������������3���ջ�����
extern uint8_t  U4_TxBuff[U4_TXBUFF_SIZE];         //�ⲿ��������������4���ͻ����� 
extern uint8_t  U4_RxBuff[U4_RXBUFF_SIZE];         //�ⲿ��������������4���ջ�����
extern uint8_t  U2_TxBuff[U2_TXBUFF_SIZE];         //�ⲿ��������������2���ͻ����� 
extern uint8_t  U2_RxBuff[U2_RXBUFF_SIZE];         //�ⲿ��������������2���ջ�����

void U1_Init(uint32_t);                            //������������ʼ������1
void u1_printf(char* fmt,...);                     //��������������1 printf����
void u1_TxData(uint8_t *, uint16_t);               //��������������1ֱ�ӷ�������

void U2_Init(uint32_t);                            //������������ʼ������2
void u2_printf(char* fmt,...);                     //��������������2 printf����
void u2_TxData(uint8_t *, uint16_t);               //��������������2ֱ�ӷ�������
void u2_TxDataBuf(uint8_t *, uint32_t);            //�����������򴮿�2���ͻ�������������

void U3_Init(uint32_t);                            //������������ʼ������3
void u3_TxData(uint8_t *, uint16_t);               //��������������3ֱ�ӷ�������
void u3_TxDataBuf(uint8_t *, uint32_t);            //�����������򴮿�3���ͻ�������������

void U4_Init(uint32_t);                            //������������ʼ������4
void u4_printf(char* fmt,...);                     //��������������4 printf����
void u4_TxData(uint8_t *, uint16_t);               //��������������4ֱ�ӷ�������
void u4_TxDataBuf(uint8_t *, uint32_t);            //�����������򴮿�4���ͻ�������������

#endif


